Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.CADObjectUniqueId
The unique id of the originating CAD object (model element) associated with this zone.
Remarks:
This id can be passed to obtain the element from Document.Element[string] property, but any element obtained through this method
may no longer point to a valid or up-to-date model element. The originating CAD object is only accurate and up-to-date at the time of creation of the energy model.
Since:
2024